<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Drovio and creates a package.</string>
	<key>Identifier</key>
	<string>com.rderewianko.autopkg.pkg.drovio</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.drovio.drovio-app</string>
		<key>NAME</key>
		<string>Drovio</string>
		<key>APP_NAME</key>
		<string>Drovio</string>
        <key>SERVER_URL</key>
        <string>Your.URL.Here</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.rderewianko.autopkg.download.drovio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/%APP_NAME%.app/Contents/Info.plist</string>
		<key>plist_version_key</key>
		<string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/build</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%APP_NAME%.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%APP_NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FetchScriptsPath</string>
            <key>Arguments</key>
            <dict>
                <key>dirname</key>
                <string>Scripts</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%dirpath%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%SERVER_URL%</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/url.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                	<key>pkgroot</key>
               		<string>%pkgroot%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%BUNDLE_ID%</string>
               	<key>scripts</key>
               	<string>%RECIPE_CACHE_DIR%/Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>

	