<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of ADPassMon(V2) and builds a package. Then, uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.rderewianko.munki.ADPassMonV2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ADPassMon</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Active Directory Password Monitor menulet app for OS X 10.8+</string>
            <key>display_name</key>
            <string>ADPassMon</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Applications</string>
            <key>developer</key>
            <string>MacMule</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rderewianko.pkg.ADPassMon</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>