<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest PingID desktop app for macOS.</string>
        <key>Identifier</key>
        <string>com.rderewianko.download.PingID</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PingID</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://www.pingidentity.com/en/resources/downloads/pingid.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_PAGE_URL%</string>
                    <key>re_pattern</key>
                    <string>[^"]+\.pkg</string>
                    <key>result_output_var_name</key>
                    <string>match</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Ping Identity Corporation (6U3RF4C84N)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>