<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Joel you should really use github.</string>
    <key>Description</key>
    <string>Downloads the latest version of DEPNotify and creates a package.</string>
    <key>Identifier</key>
    <string>com.rderewianko.pkg.DEPNotify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DEPNotify</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.rderewianko.download.DEPNotify</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
