<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Joel, gitlab is a bit better.</string>
	<key>Description</key>
	<string>Downloads the latest version of DEPNotify and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.rderewianko.munki.DEPNotify</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DEPNotify</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>DEPNotify is a splash screen for the start of your dep workflow..</string>
            <key>display_name</key>
            <string>PingID</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.rderewianko.download.DEPNotify</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
