<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>ARCH: use "arm64" for Apple Silicon (default) or "x64" for Intel. Example: autopkg run com.rderewianko.download.TrezorSuite -k ARCH=x64</string>
	<key>Description</key>
	<string>Downloads the latest version of Trezor Suite.</string>
	<key>Identifier</key>
	<string>com.rderewianko.download.TrezorSuite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Trezor Suite</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>version:\s*(\d+\.\d+\.\d+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://data.trezor.io/suite/releases/desktop/latest/latest-mac.yml</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%ARCH%.dmg</string>
				<key>url</key>
				<string>https://data.trezor.io/suite/releases/desktop/latest/Trezor-Suite-%version%-mac-%ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Trezor Suite.app</string>
				<key>requirement</key>
				<string>identifier "io.trezor.TrezorSuite" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C3P22XVH2C</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Trezor Suite.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
