<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Broadcore Communicator.</string>
    <key>Identifier</key>
    <string>com.github.rderewianko.autopkg.download.BCCommunicator</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Broadcore Communicator</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                http://www.masergy.com/sites/default/files/software/Communicator.btbc.mac-20.0.1.240-BRC.zip
                <string>http://www.masergy.com/solutions/unified-communications/software-download</string>
                <key>re_pattern</key>
                <string>(?P&lt;zip&gt;Communicator.btbc.mac-.*.*.*.*.zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.masergy.com/solutions/unified-communications/software-download</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
