<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest arm64 (Apple Silicon) release of Codex CLI from GitHub.

Uses GitHubReleasesInfoProvider so the API call is authenticated via AutoPkg's
standard GITHUB_TOKEN preference (or ~/.config/github_token), avoiding the
60-req/hour unauthenticated rate limit that was causing URLTextSearcher to
fail intermittently on shared CI runners.</string>
	<key>Identifier</key>
	<string>com.rderewianko.download.CodexCLI</string>
	<key>Input</key>
	<dict>
		<key>ASSET_REGEX</key>
		<string>^codex-aarch64-apple-darwin\.tar\.gz$</string>
		<key>GITHUB_REPO</key>
		<string>openai/codex</string>
		<key>NAME</key>
		<string>CodexCLI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ASSET_REGEX%</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-aarch64-apple-darwin.tar.gz</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
