<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest arm64 (Apple Silicon) release of Codex CLI from GitHub.</string>
	<key>Identifier</key>
	<string>com.rderewianko.download.CodexCLI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CodexCLI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--retry</string>
					<string>3</string>
					<string>--retry-delay</string>
					<string>5</string>
				</array>
				<key>re_pattern</key>
				<string>"browser_download_url":\s*"(?P&lt;download_url&gt;https://github\.com/openai/codex/releases/download/(?P&lt;tag&gt;[^"/]*?(?P&lt;version&gt;\d+\.\d+\.\d+)[^"/]*)/codex-aarch64-apple-darwin\.tar\.gz)"</string>
				<key>request_headers</key>
				<dict>
					<key>Accept</key>
					<string>application/vnd.github+json</string>
					<key>X-GitHub-Api-Version</key>
					<string>2022-11-28</string>
				</dict>
				<key>result_output_var_name</key>
				<string>download_url</string>
				<key>url</key>
				<string>https://api.github.com/repos/openai/codex/releases/latest</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-aarch64-apple-darwin.tar.gz</string>
				<key>url</key>
				<string>%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
