<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Baseline by Second Son Consulting.</string>
	<key>Identifier</key>
	<string>com.rderewianko.download.baseline_noDaemon</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>SecondSonConsulting/Baseline</string>
		<key>NAME</key>
		<string>Baseline</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>Baseline_NoDaemon_v.+.pkg</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
